Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J05.e.tmx
Source language: en_us
Languages: zh_cn

source: Chapter 1 Introduction
zh_cn: 第1章绪论

source: In this introductory chapter, I discuss the nature of thermodynamics and the type of problems that may be treated by the subject. I also collect together several introductory concepts regarding the nature of processes that are addressed by thermodynamics, concept of work from mechanics that lie at the foundation of thermodynamics, and several atomistic concepts that are important for developing insights into the thermal and energetic properties of matter, which are treated by thermodynamics at a macroscopic level.
zh_cn: 本章将讨论热力学的性质及其所要处理的问题的类型，并要归纳一些基本的概念，这些概念涉及热力学所描述过程的性质、作为热力学重要基础的机械功的概念，以及若干原子学的概念。后者对于在宏观水平上深入认识热力学所处理体系的热和能的性质意义重大。

source: Finally, I conclude this chapter with a brief discussion of units and conversion factors.
zh_cn: 本章最后还简要讨论了单位和换算因子。

source: 1.1 Nature and Scope of Thermodynamics
zh_cn: 1.1热力学的性质和范围

source: Thermodynamics deals with the problem of conversion of one form of energy to another.
zh_cn: 热力学处理一种形式的能转化为另一种形式的能的问题。

source: Classical thermodynamics emerged primarily during the nineteenth century.
zh_cn: 经典热力学出现于19世纪。

source: Thus, the development of fundamental concepts of classical thermodynamics, like those of Mechanics and Electricity and Magnetism, precedes the development of modern concepts of the atomic or microscopic states of matter.
zh_cn: 经典热力学的基本概念的发展如同机械学、电学和磁学一样，走在物质原子学或微观状态学的现代概念发展的前面。

source: There is also a non-classical arm of thermodynamics, known as irreversible thermodynamics, which is primarily a modern development.
zh_cn: 另外还有一种近代发展的非经典热力学的分支，即不可逆过程热力学。

source: The laws of classical thermodynamics were formulated by deduction from experimental observations on macroscopic scales.
zh_cn: 经典热力学定律的公式来自对宏观尺度上实验结果的推导。

source: Consequently, the thermodynamic laws are empirical in nature, and a thermodynamic system in which the laws are supposed to hold consists of a large number of atoms or molecules, of the order of Avogadro's number (1023).
zh_cn: 因此，热力学定律基本上是经验性的，并且热力学定律所有效处理的体系含有大量达到阿伏伽德罗常数数量级（1023）的原子数或分子数。

source: We, of course, know now that all macroscopic properties of a system (such as pressure, temperature, volume etc.) have their origin in the motions and interactions of the atoms or molecules comprising the system.
zh_cn: 当然，现在知道体系的宏观性质（诸如压力、温度、体积等）其实都是由于组成体系的原子或分子的移动和相互作用。

source: Thermodynamics, by itself, does not provide any fundamental insight as to the origin of thermodynamic laws and thermodynamic properties of matter.
zh_cn: 热力学本身对于热力学定律的原理及其物质的热力学性质并不提供任何根本性的说明。

source: The treatment of macroscopic properties in terms of statistical average of the appropriate properties of a large number of microscopic entities (atoms or molecules) constitutes the subject of classical Statistical Mechanics.
zh_cn: 对宏观性质的处理，即根据大数量的微观原子或分子的适当统计平均值构成了经典统计热力学的主体。

source: While it provides analytical relationships between macroscopic properties and microscopic motions in a system, actual calculation of macroscopic properties from such relationships is a very difficult task.
zh_cn: 虽然统计热力学提供了体系的宏观和微观性质之间的分析关系，但实际上要从这样一种关系中来计算宏观性质还是很困难的任务。

source: This is because of our lack of precise knowledge of the energetic properties of the microscopic entities, and computational difficulties.
zh_cn: 这是因为我们尚缺少对微观实体的能量性质的精确了解，以及计算本身的困难。

source: However, considerable progress has been made in both directions in recent years leading to what has become known as the Molecular Dynamics or MD simulations.
zh_cn: 但是，近些年来在上述两方面都取得了长足进步，出现了分子动力学或分子动力模拟的研究学科。

source: These simulations represent a merger of statistical and classical mechanics, and hold great potential in predicting the thermodynamic and other macroscopic properties through considerations of microscopic interactions, and in refining our knowledge of the energetic properties in the atomic scale through comparison of the predicted and observed macroscopic properties.
zh_cn: 这些模拟研究表明了统计力学和经典力学的结合，并且通过进一步研究微观相互作用，以及比较预测和实际测定的宏观性质，从而在分子尺度上更精细地认识能量性质，这就可以预测热力学和其他宏观性质。

source: In addition, because of the enormous improvements in computational abilities, significant progress has also been made in the calculation of thermodynamic properties using purely quantum chemical approaches.
zh_cn: 此外，由于在计算技术上误差的减少，采用纯量子化学方法所进行的热力学性质的计算也取得了极大的进展。

source: The fundamental concepts of classical thermodynamics have followed primarily from considerations of the problem of conversion of heat into mechanical work and vice versa, which inspired the great “Industrial Revolution”.
zh_cn: 经典热力学的基本概念主要来自于山热和机械功相互转换问题的研究，众所周知的“工业革命”也是由此激发而来的。

source: These have led to formal relationships among the macroscopic variables, and to descriptions of the equilibrium state of a macroscopic system under various sets of imposed conditions. (When a system achieves equilibrium consistent with the imposed conditions, all properties in the macroscopic scale not only remain unchanged, but also do not have any tendency to change with time as long as these conditions are not disturbed).
zh_cn: 这种转换问题的研究势必要考虑众多宏观变质的相互关系，并且要描述一个宏观体系在各种强加条件下的平衡状态（当一个体系达到与强加条件相一致的平衡时，各种宏观尺度的性质不但保持不变，而且只要这些强加条件不变，它们也不随时间而改变）。

source: Thermodynamics tells us that the macroscopic equilibrium state of a system depends only on the externally imposed conditions, such as pressure, temperature, volume, and is totally independent of the initial condition or the history of the system.
zh_cn: 热力学所阐明的就是一个体系的宏观平衡状态仅仅依赖于体系外部的强加条件，诸如压力、温度、体积，而与其初始条件或过程无关。

source: Historically, this represented a major point of departure from the viewpoint of Newtonian mechanics that seeks to predict the evolutionary course of a system on the basis of its initial conditions.
zh_cn: 从学科发展史来看，热力学不同于牛顿的经典力学，后者基于初始条件来预测体系的运动进程。

source: Classical thermodynamics is a subject of great power and generality, and has influenced the development of important concepts in physical, chemical, biological and geological sciences, as well as in practical aspects of engineering.
zh_cn: 经典热力学研究能量问题，因此，从广泛意义上说，大凡物理学、化学、生物学、地质学以及实际工程学的许多重要概念的发展无不受其重大影响。

source: But it demands a moderate mathematical knowledge that is within the easy reach of a serious (or even not so serious) student of science or engineering.
zh_cn: 当然，这门学科需要一定程度的数学知识，但这对于一个乐意委身（甚至不一定委身）于理工科的学生来说不是一个问题。

source: At the same time, thermodynamics has a rigorously logical structure that is often quite subtle.
zh_cn: 然而，热力学又是具有严密逻辑结构因而常常是很精细又很难的学科。

source: These aspects make the subject of thermodynamics apparently easy to learn, but yet difficult to completely appreciate in terms of its implications.
zh_cn: 这些特点决定了热力学这门学科既容易学习，而完全认识其内涵又很难。

source: There are three laws at the foundation of thermodynamics, which are known as the first law, second law and third law, but most of the subject has been built on the first two laws.
zh_cn: 热力学的理论基础是三大定律，即热力学第一、第二和第三定律，其中第一和第二定律构筑该学科的大部分内容。

source: The second law of thermodynamics represents a supreme example of logical deduction of a revolutionary physical principle from systematic analysis of simple experimental observations.
zh_cn: 对于通过纯粹的实验观察进行体系分析，从而逻辑地导出一个突破性的物理原理来说，热力学第二定律可以说是一个极佳的例子。

source: Because the basic concepts of thermodynamics are independent of any microscopic models, they have been unaffected by the developments in the microscopic description of matter – the validity of the laws were not threatened by discovery of errors in the microscopic models, nor the developments in thermodynamics took a quantum jump with exciting new discoveries in the microscopic domain.
zh_cn: 由于热力学的基本概念是不依赖任何微观模型的，所以这些概念不受任何有关这些微观模型变化的影响，也就是说，如果这些模型被发现有问题，对热力学定律的有效性没有任何影响，当然对于热力学因微观世界的新发现而发展到量子化理论也就没有任何作用。

source: 1.2 Irreversible and Reversible Processes
zh_cn: 1.2 不可逆过程和可逆过程

source: Consider a gas inside a rigid cylinder fitted with a movable piston. Let Pint be the internal pressure of the gas and Pext be the pressure exerted on the gas from outside through the piston.
zh_cn: 考虑一个充气的带移动活塞的刚性圆筒，其内部气压为Pint；经由活塞作用到气体的外部的压力为Pext。

source: If Pint > Pext then the gas will expand, and vice versa.
zh_cn: 如果Pint > Pext，则气体将膨胀。

source: Suppose now that the gas is allowed to expand rapidly to a particular volume, Vf.
zh_cn: 假设其快速膨胀到一个特定的体积Vf。

source: During this rapid expansion the gas will be in chaotic motion, which will be visible even by macroscopic observation.
zh_cn: 在此快速膨胀过程中，气体本身处在一个混乱运动的状态，从宏观的角度甚:至都能观察得到。

source: Now let the gas be rapidly compressed back to its initial volume, Vi.
zh_cn: 接下来，又把气体快速压缩回初始的体积Vi。

source: After a while, the state of the gas will be the same as what it was at the beginning of the cyclic process, but the intermediate states during compression will be different from those during expansion.
zh_cn: 那么一段时间后，气体的状态将和活塞移动前的状态完全一样，但是在压缩过程中的各个中间状态与膨胀过程中的各个中间状态是不一样的。

source: This is an example of an Irreversible Process.
zh_cn: 这个过程称为不可逆过程。

source: Now imagine that the expansion of the gas from Vi to Vf is carried out in small incremental steps, as illustrated in Fig. 1.1, and that at each step the gas is held for a sufficiently long time to allow it to achieve equilibrium with the external pressure. If the process is reversed following the same procedure, then the state of the gas at a given position of the piston, say P3, will be the same during both expansion and contraction, but not during the stage between two specific steps, say P3 and P4.
zh_cn: 如图1.1所示，设气体的初始体积为Vi，经由若干很小的体积扩张的步骤，达到最终的体积Vf，其中每一步都保持足够长的时间，让内外压力达到平衡，如果将上述过程反转过来，那么，在给定的每一个活塞的位置，气体的压力P3无论在其膨胀或压缩过程中都是一样的，但在膨胀或压缩过程中的两个位置之间，例如P3和P4之间的某个位置，不同过程的压力是不一样的。

source: However, the size of the steps can be made arbitrarily small, at least conceptually, so that the state of the gas during expansion are recovered during compression at any arbitrary position of the piston.
zh_cn: 然而，两步的间隔可足够小，以至在任意给定的活塞位置，膨胀过程的气体状态与压缩过程的气体状态完全相同。

source: This is an example of a Reversible or Quasi-static Process.
zh_cn: 这个例子即所谓的可逆过程或准静态过程。

source: Thus, reversible process is a process that is carried out at a sufficiently slow rate such that the properties of the system at any state during the process differ by infinitesimal from those of its equilibrium state.
zh_cn: 可见，可逆过程可以足够慢的速率实现，以至过图1.1程中任何状态的体系性质与平衡状态下的性质的差异无限小。

source: The process is called reversible since a very very small (i.e. infinitesimal) change in the external condition causes the system to reverse its direction of change.
zh_cn: 这个过程叫作可逆过程正是因为外部条件非常非常小（无限小）的变化即可造成体系转换变化方向。

source: All natural processes are irreversible, but a natural process may take place sufficiently slowly to approximate a reversible process.
zh_cn: 所有自然过程都是不可逆的，但一个自然过程也可能发生得足够慢而近似于一个可逆过程。

source: By this we mean that the time (. . .) over which a significant change of state of the system takes place is large compared to the time the system takes to achieve equilibrium, which is often referred to as the relaxation time, . . ..
zh_cn: 这意味着自然体系的状态发生显著变化所需的时间（. . .）要大于该体系趋于平衡的时间，后者也常称为弛豫时间（. . .）。

source: The latter has a wide range of values, depending on the nature of the system and the perturbation produced in the system by the changing state conditions.
zh_cn: 弛豫时间的范围很大，取决于体系的性质和由于状态条件的改变而产生的体系的扰动。

source: As an example, for the problem of expansion of gas considered above, it can be shown that @@V1/3/C,
zh_cn: 如上面所涉及的气体膨胀问题，可以证明@@V1/3/C，

source: where V is the volume of the cylinder and C is the velocity of sound in the gas (Callen, 1985), whereas for mineralogical reactions in geological or planetary processes, @ is often as high as millions of years.
zh_cn: 其中V是活塞空腔的体积，C是气体中的声速（Callen，1985）。对于地质或行星过程中的矿物反应来说，@常常高达数百万年。

source: 1.3 Thermodynamic Systems, Walls and Variables
zh_cn: 1.3 热力学体系、边界和变量

source: Any arbitrary but well defined part of the universe, subject to thermodynamic analysis, constitutes a thermodynamic system.
zh_cn: 宇宙中的任何一个用作热力学分析的确定部分构成了一个热力学体系。

source: The rest of the universe is called the surrounding.
zh_cn: 而其以外的其他宇宙部分则叫作环境。

source: A system is separated from the surrounding by a wall.
zh_cn: 体系与环境即由所谓的界面隔开。

source: We can recognize the following types of systems.
zh_cn: 体系可归纳为以下类型：

source: Open System: A system which can exchange both energy and matter with the surrounding across its boundaries or walls.
zh_cn: 开放体系:能够通过界面与周围环境交换能量和物质的体系。

source: Closed System: A system which can exchange energy with the surrounding, but not matter.
zh_cn: 封闭体系：能够通过界面与周围环境交换能量但不能交换物质的体系。

source: Isolated Systems: A system which can exchange neither energy nor matter with the surrounding.
zh_cn: 孤立体系：无法通过界面与周围环境交换能量和物质的体系。

source: In order to make the existence of different systems possible, thermodynamics had also to device different types of wall, which are as follows.
zh_cn: 与上述不同的体系相对应，热力学还划分了以下不同类型的界面：

source: Diathermal or non-adiabatic Wall: A wall that is impermeable to mass transfer, but permits transfer of heat through conduction. A closed system, in the sense defined above, is surrounded by diathermal wall.
zh_cn: 透热或非绝热界面:物质不能渗透，但因导热性能传递热量的界面。

source: Adiabatic Wall: A wall that does not permit either mass or heat transfer across it.
zh_cn: 绝热界面:物质和热量均不能传递的界面。

source: Ignoring the effects due to force fields (e.g gravitational field), a system surrounded by an adiabatic wall can be affected from outside only through expansion or compression by moving the wall.
zh_cn: 如果外力场（如重力场）的影响忽略不计，那么由绝热界面所包围的体系仅能为界面移动造成的膨胀或压缩所影响。

source: The type of internally evacuated double wall used to make dewars for liquid nitrogen or helium is an example of an almost adiabatic wall.
zh_cn: 例如，灌满液氮或液氮的杜瓦瓶的双层内真空外壁就是极佳的绝热界面。

source: If we ignore the effects due to the force fields, a system surrounded by a rigid adiabatic wall constitutes an isolated system.
zh_cn: 如果忽略外力影响，这种完全由绝热界面所包围的体系就组成了一个孤立体系。

source: Semi-permeable Wall: This type of wall permits selective transfer of matter, and are also called semi-permeable membrane.
zh_cn: 半渗透界面:这类界面允许物质选择性传递，因而也叫作半渗透膜。

source: For example, platinum and palladium are well known to be permeable to hydrogen, but not to oxygen or water (this property of the metals are made use of in some clever designs in experimental petrology to control oxygen partial pressure, e.g. Eugester and Wones, 1962).
zh_cn: 例如，铂和钯能透过氢气，但不能透过氧气和水（在实验岩石学中，利用这一性质可以有效地控制氧逸度，见Eugester，Wones（1962））。

source: As we would see later, the thermodynamic walls play very important roles in the derivation of conditions that determine the evolution of a system towards the equilibrium state (see Lavenda, 1978 for an insightful discussion).
zh_cn: 正如以后要讨论的，热力学界面的概念在导出确定一个体系趋于平衡的条件方面扮演着重要的作用（深入讨论见Lavenda（1978））。

source: The thermodynamic potentials are defined only for the equilibrium states.
zh_cn: 热力学势都是仅指其平衡状态而言的。

source: Thus, one is faced with the paradoxical situation of determining the behavior of the potentials as a system evolves toward an equilibrium state, since the potentials are not defined for the non-equilibrium states.
zh_cn: 这样，既然热力学势不是对非平衡状态定义的，那么对于确定一个要趋于平衡的体系的热力学势来说，多少就有些矛盾。

source: To resolve this problem, Constantin Caratheodory (1873–1950), a German mathematician of Greek origin, introduced the concept of composite systems, in which the subsystems are separated from one another by specific types of walls.
zh_cn: 要解决这一问题，希腊裔德国数学家卡拉西奥多里（Constantin Caratheodory，1873-1950）引进了组合体系的概念。在该体系中，各子体系为特定的界面所分隔。

source: Each subsystem is at equilibrium consistent with the restriction imposed by the internal and external walls, and thus has defined values of thermodynamic potentials.
zh_cn: 每一个子体系处在由内部和外部界面所强制的平衡条件下，因而有确定的热力学势值。

source: The internal walls separating the susbsytems are then replaced by different types of walls and the system is now allowed to come to a new equilibrium state that is consistent with the new restrictions.
zh_cn: 如果将各子体系分隔的内部界面用不同类型的界面代替，则体系就要对于新的限制条件重新调整平衡。

source: This procedure reduces the problem of evolution of a system to one of a succession of equilibrium states.
zh_cn: 这个过程就将一个体系的平衡演化问题简化到一个连续的平衡状态的问题。

source: We would see several examples of the application of the concept of "composite system" later.
zh_cn: 关于“组合体系”概念的一些应用例子将在后文述及。

source: The thermodynamic variables are broadly classified into two groups, extensive and intensive. The values of the extensive variables depend on the extent or size of the system.
zh_cn: 热力学的变量广义上可分成两组：广度变量和强度变量，广度变量的数值取决于该体系的范围或大小。

source: They are additive, i.e. the value of an extensive variable E for an entire system is the sum of its values, Es , for each subsystem (E = @Es).
zh_cn: 它们具有可加性，即一个体系的一个广度变量E是每个子体系的广度变量Es的总和（E=@Es）。

source: Volume, heat, mass are familiar examples of extensive variables.
zh_cn: 如体积、热量和质量都是熟知的广度变量的例子。

source: The value of an intensive variable for a system, on the other hand, is independent of the size of the system. Familiar examples are pressure, temperature, density etc.
zh_cn: 另一方面，任何一个强度变量的值与体系的大小无关，例如压力、度、密度等等。

source: These properties are not additive, and if the system is at equilibrium, then the value of an intensive variable at any point of the system is the same as in any other point.
zh_cn: 它们不具备可加性，因此，如果体系处于平衡，则体系中任意一点的强度变量值与其他点上的值相同。

source: For every extensive variable, it is possible to find a conjugate intensive variable such that the product of the two variables has the dimension of energy.
zh_cn: 但对于每一种广度变量来说，有可能找到与其共辄的一个强度变星，使它们的乘积具有能量量纲。

source: For example, for E = volume (V), conjugate I = pressure (P); for E = Area (A), conjugate I = surface tension (. . .); for E = length (L), conjugate I = Force (F) etc.
zh_cn: 例如，如果E=体积（V），则其共扼变量为I=压力（P）；而如果E=面积（A），则共扼变量为I=表面张力（. . .）；若E=长度（L），则共扼变最为I=力（F）。
